//*********Приклад роботи синхронного та асинхронного JS**************\\

// console.log("A"); // 1

// setTimeout(() => console.log("B"), 0); // 4

// Promise.resolve("C").then((value) => console.log(value)); // 3

// console.log("D"); // 2

// console.log("A"); // 1

// setTimeout((logB = () => console.log("B")), 501); // 6
// setTimeout((logE = () => console.log("E")), 500); // 5
// setTimeout((logF = () => console.log("F")), 499); // 4

// Promise.resolve("C").then((value) => console.log(value)); // 3

// console.log("D"); // 2

//*********Поділення асинхронного JS на мікро та макро процеси**************\\

// ******Мікро процеси***** \\
// Promise
// Observer
// addEventListner

// ******Макро процеси****** \\
// setTimeout
// setInterval
// https://developer.mozilla.org/en-US/docs/Web/API/Window/setImmediate
// setImmediate
// https://developer.mozilla.org/en-US/docs/Web/API/window/requestAnimationFrame
// requestAnimationFrame

//*********Приклад роботи синхронного та асинхронного JS**************\\
// Пронумеруй виклики методів відповідно до порядку їх виконання

// console.log("A"); // 1

// setTimeout(() => console.log("B"), 0); //  5

// Promise.reject("C")
//   .then((value) => console.log(value)) // 4
//   .catch((err) => console.log(err));

// Promise.resolve("D").then((value) => console.log(value)); // 3

// setTimeout(() => console.log("E"), 0); //  6

// console.log("F"); // 2

//*************** Promise *******************\\

// ****Створення Promise**** \\
/* Promise - це обʼєкт, який є результатом асинхронної операції. Проміс має 3 стани

- Fullfilled: стан, коли проміс виконався успішно (наприклад, якщо ви викликали ф-цію resolve)
- Rejected: стан, коли проміс виконався не успішно(тобто, з помилкою, наприклад, якщо ви викликали ф-цію rejected)
- Pending: стан, коли проміс ще не виконався, тобто поки що немає результату асинхронної операції(наприклад, якщо ви послали запит на сервер, а він довго відповідає)

Не існує стану Settled, але це умовна назва для означення того, що проміс просто виконався (або він Fullfilled, або він Rejected)

Проміс приймає функцію executor (new Promise(executor)), яка приймає ще дві функції для переведення промісу у стан Fullfilled(resolve), або у стан Rejected(rejected). Ця функція не є асинхронною, тобто, вона виконається у синхронному послідовному коді.

*/

// const promise = new Promise((res, rej) => {
//   const rand = Math.random();

//   setTimeout(() => {
//     if (rand < 0.5) {
//      res("✅️");
//     } else {
//      rej("❌");
//     }
//   }, 1000);
// });

// ****Обробка Promise**** \\

/*
Для обробки результату асихнронної операції використовуються наступні методи:
- then(onResolve) - приймає колбек функцію і обробляє успішне виконання промісу. Повертає проміс
- catch(onErr) - приймає колбек функцію, яка приймає повідомлення про помилку, обробляє неуспішне виконання промісу. Повертає проміс. 
- finally() - приймає колбек функцію, яка викликається в не залежності від того, чи успішно виконався проміс, чи ні. Просто виконуює якусь дію по готовності промісу.

Фактично імітація синхронності виконання асинхронного коду

*/

// promise.then((data) => console.log(`Then block. Result: ${data}`))
// .catch((err) => console.log(`Catch block. Err: ${err}`))
// .finally(() => console.log("Finally block."))

// ****************************Практика************************* \\
// Наше завдання написати програмне забезпечення для ігрового автомата
// Для вирішення завдання використай готову розмітку HTML та базову стилізацію
// Після натиснення на кнопку "Start game" в кожному віконці по черзі має з'являтись смайлик з затримкою в 1 секунду ('🤑' або '👿')
// Під час обробки кожного віконця створи масив з Promis-ами в якому кожен з них буде відповідати за своє віконце, після чого оброби даний масив за допомогою методу Promise.allSettled
// Після того як всі віконця були заповнені потрібно щоб скріпт автоматично визначав чи гравець переміг, чи ні. Якщо в кожному віконці однаковий смайлик це означає що користувач переміг
// Виводить модальне вікно з повідомленням про статус гри ('Winner' або 'Loser')
// Для модального вікна використовуй бібліотеку basicLightbox
// Після повторного натискання на кнопку "Start game" поле має очищатись, а гра починатись з початку.

/*
  1. отримати всі рефси
  2. створюємо функцію яка буде створювати і повертати проміс з рандомним смайликом (завʼязка на 0.5)
  3. вішаємо слухач по кліку на кнопку старт гейм(+ відключати кнопку)
    3.1. створюємо масив промісів (виклик функції з п.2) на основі кількості наших квадратиків
    3.2. за допомгою методу Promise.allSettled() чекаємо на виконання всіх промісів і повертаємо проміс, у якому є масив виконаних промісів
    3.3. перевірити виграшну комбінацію (користувач виграв, якщо всі проміси однакового стану, або всі фулфілд, або всі реджектед)
    3.4. перебираємо масив промісів і на кожній ітерації робимо такі дії:
      3.4.1. записуємо в текст контент клітинки пусту строку (для того, щоб очистити всі клітинки перед початком нової гри)
      3.4.2. запускаємо затримку довжиною в 1, 2, 3... і тд секунди для кожної клітинки
      3.4.3. записуємо в текст контент клітинки результат промісу(смайлик)
      3.4.4. робимо перевірку що ми знаходимо на останній клітинці, якщо так, то запускаємо перевірку на перемогу(п 3.3), якщо переміг - виводимо модальне вікно
*/

const refs = {
  startBtn: document.querySelector(".js-start"),
  container: document.querySelector(".js-container"),
};

refs.startBtn.addEventListener("click", handleStartGame);

function handleStartGame() {
  refs.startBtn.disabled = true;
  // const promises = [...refs.container.children].map(() => createNewPromise());
  const promises = [...refs.container.children].map(createNewPromise); // створення масиву з промысів на основі масиву дітей контейнера
  console.log(promises);

  // чекаємо поки виконаються всі проміси і після цього можемо обробити масив з виконаними промісами
  Promise.allSettled(promises).then((items) => {
    console.log(items);

    // перевірка, якщо кожен проміс має однаковий стан, то ми перемогли
    const isWinner =
      items.every(({ status }) => status === "fulfilled") ||
      items.every(({ status }) => status === "rejected");

    items.forEach((item, i) => {
      refs.container.children[i].textContent = ""; // очищуємо все поле для нової гри

      // запуск таймауту на відкриття кожної клітинки через секунду
      setTimeout(() => {
        refs.container.children[i].textContent = item.value || item.reason; // заповнюємо текст контект клітинки або смайликом з грошима, або смайликом демоном, в залежності від того, який у нас обʼєкт результату промісу

        // перевірка що ми знаходимо на останній клітинці (тому що немає сенсу показувати модалку з результатми, якщо користувач ще не побачив всі відкриті клітинки). Тому якщо індекс поточного елементу дорівнює кількості елементів в масиві - 1(бо індекси з 0), значит ми на останньому елементі і можемо показувати модалку
        if (i === items.length - 1) {
          const instance = basicLightbox.create(`
            <h1>${isWinner ? "Winner" : "Loser"}</h1>
          `);

          instance.show();
          refs.startBtn.disabled = false;
        }
      }, 1000 * (i + 1));
    });
  });
}

function createNewPromise() {
  return new Promise((res, rej) => {
    const rand = Math.random();

    if (rand > 0.5) {
      res("🤑");
    } else {
      rej("👿");
    }
  });
}
